In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3
import prettytable
%matplotlib inline
%load_ext sql
prettytable.DEFAULT = 'DEFAULT'

In [2]:
df1 = pd.read_csv('D:\DataSci\Resources\ChicagoCensusData.csv')
df2 = pd.read_csv('D:\DataSci\Resources\ChicagoCrimeData.csv')
df3 = pd.read_csv('D:\DataSci\Resources\ChicagoPublicSchools.csv')

In [3]:
con = sqlite3.connect("FinalDB.db")
cur = con.cursor()
%sql sqlite:///FinalDB.db

In [4]:
df1.to_sql("CENSUS_DATA", con, if_exists='replace')
df2.to_sql("CHICAGO_CRIME_DATA", con, if_exists='replace')
df3.to_sql("CHICAGO_PUBLIC_SCHOOLS", con, if_exists='replace')

566

In [6]:
%%sql
SELECT * from CHICAGO_CRIME_DATA LIMIT 5;

 * sqlite:///FinalDB.db
Done.

[(0, 3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)'),
 (1, 3406613, 'HK456306', '2004-06-26', '009XX N CENTRAL PARK AVE', '820', 'THEFT', '$500 AND UNDER', 'OTHER', 0, 0, 1112, 11, 27.0, 23.0, '6', 1152206.0, 1906127.0, 2004, 41.89827996, -87.71640551, '(41.898279962, -87.716405505)'),
 (2, 8002131, 'HT233595', '2011-04-04', '043XX S WABASH AVE', '820', 'THEFT', '$500 AND UNDER', 'NURSING HOME/RETIREMENT HOME', 0, 0, 221, 2, 3.0, 38.0, '6', 1177436.0, 1876313.0, 2011, 41.81593313, -87.62464213, '(41.815933131, -87.624642127)'),
 (3, 7903289, 'HT133522', '2010-12-30', '083XX S KINGSTON AVE', '840', 'THEFT', 'FINANCIAL ID THEFT: OVER $300', 'RESIDENCE', 0, 0, 423, 4, 7.0, 46.0, '6', 1194622.0, 1850125.0, 2010, 41.74366532, -87.56246276, '(41.743665322, -87.562462756)'),
 (4, 10402076, 'HZ138551', '2016-02-02', '033XX W 66TH ST', '820', 'THEFT', '$500 AND UNDER', 'ALLEY', 0, 0, 831, 8, 15.0, 66.0, '6', 1155240.0, 1860661.0, 2016, 41.7734553, -87.70648047, '(41.773455295, -87.706480471)')]

### Problem 1

In [ ]:
%%sql
SELECT COUNT(*) from CHICAGO_CRIME_DATA;

 * sqlite:///FinalDB.db
Done.

[(533,)]

In [9]:
%%sql
SELECT * from CENSUS_DATA LIMIT 5;

 * sqlite:///FinalDB.db
Done.

[(0, 1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (1, 2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (2, 3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0),
 (3, 4.0, 'Lincoln Square', 3.4, 10.9, 8.2, 13.4, 25.5, 37524, 17.0),
 (4, 5.0, 'North Center', 0.3, 7.5, 5.2, 4.5, 26.2, 57123, 6.0)]

## Problem 2

In [10]:
%%sql 
SELECT COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME from CENSUS_DATA 
WHERE PER_CAPITA_INCOME < 11000;

 * sqlite:///FinalDB.db
Done.

[(26.0, 'West Garfield Park'),
 (30.0, 'South Lawndale'),
 (37.0, 'Fuller Park'),
 (54.0, 'Riverdale')]

## Problem 3

In [ ]:
%%sql
SELECT DISTINCT(PRIMARY_TYPE) from CHICAGO_CRIME_DATA;

In [15]:
%%sql
SELECT CASE_NUMBER from CHICAGO_CRIME_DATA
WHERE DESCRIPTION in (SELECT DISTINCT(DESCRIPTION) from CHICAGO_CRIME_DATA WHERE DESCRIPTION like "%MINOR%");

 * sqlite:///FinalDB.db
Done.

[('HL266884',), ('HK238408',)]

## Problem 4

In [16]:
%%sql
SELECT DISTINCT(PRIMARY_TYPE) from CHICAGO_CRIME_DATA
where PRIMARY_TYPE like "%KIDNAPPING%";

 * sqlite:///FinalDB.db
Done.

[('KIDNAPPING',)]

In [19]:
%%sql 
SELECT PRIMARY_TYPE,DESCRIPTION,CASE_NUMBER from CHICAGO_CRIME_DATA
where PRIMARY_TYPE = (SELECT DISTINCT(PRIMARY_TYPE) from CHICAGO_CRIME_DATA
where PRIMARY_TYPE like "%KIDNAPPING%") and DESCRIPTION like "%CHILD%";

 * sqlite:///FinalDB.db
Done.

[('KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'HN144152')]

## Problem 5

In [22]:
%%sql
SELECT DISTINCT(PRIMARY_TYPE) from CHICAGO_CRIME_DATA
where LOCATION_DESCRIPTION like "%SCHOOL%";

 * sqlite:///FinalDB.db
Done.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

## Problem 6

In [23]:
%%sql
SELECT `Elementary, Middle, or High School` , AVG(SAFETY_SCORE) from CHICAGO_PUBLIC_SCHOOLS
GROUP BY (`Elementary, Middle, or High School`);

 * sqlite:///FinalDB.db
Done.

[('ES', 49.52038369304557), ('HS', 49.62352941176471), ('MS', 48.0)]

## Problem 7

In [24]:
%%sql
SELECT COMMUNITY_AREA_NAME from CENSUS_DATA
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC
LIMIT 5;

 * sqlite:///FinalDB.db
Done.

[('Riverdale',),
 ('Fuller Park',),
 ('Englewood',),
 ('North Lawndale',),
 ('East Garfield Park',)]

## Problem 8

In [27]:
%%sql
SELECT * from CHICAGO_CRIME_DATA LIMIT 2;

 * sqlite:///FinalDB.db
Done.

[(0, 3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)'),
 (1, 3406613, 'HK456306', '2004-06-26', '009XX N CENTRAL PARK AVE', '820', 'THEFT', '$500 AND UNDER', 'OTHER', 0, 0, 1112, 11, 27.0, 23.0, '6', 1152206.0, 1906127.0, 2004, 41.89827996, -87.71640551, '(41.898279962, -87.716405505)')]

In [30]:
%%sql
SELECT COMMUNITY_AREA_NAME from CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = 25;

 * sqlite:///FinalDB.db
Done.

[('Austin',)]

In [29]:
%%sql
SELECT COMMUNITY_AREA_NUMBER, COUNT(ID) as COUNT from CHICAGO_CRIME_DATA GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT DESC LIMIT 1;

 * sqlite:///FinalDB.db
Done.

[(25.0, 43)]

## Problem 9

In [32]:
%%sql
SELECT COMMUNITY_AREA_NAME from CENSUS_DATA
WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) from CENSUS_DATA);

 * sqlite:///FinalDB.db
Done.

[('Riverdale',)]

## Problem 10

In [33]:
%%sql
SELECT COMMUNITY_AREA_NAME from CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = 25;

 * sqlite:///FinalDB.db
Done.

[('Austin',)]